app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2026-05-20'
SELECT COUNT(*) AS `numrows`
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2026-05-20'
AND `status_lanjut` = 'Ralan'
SELECT COUNT(*) AS `numrows`
FROM `kamar_inap`
WHERE `tgl_keluar` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `resep_obat`
WHERE `tgl_peresepan` = '2026-05-20'
SELECT COUNT(*) AS `numrows`
FROM `permintaan_lab`
WHERE `tgl_permintaan` = '2026-05-20'
SELECT COUNT(*) AS `numrows`
FROM `permintaan_radiologi`
WHERE `tgl_permintaan` = '2026-05-20'
SELECT COUNT(*) AS `numrows`
FROM `mlite_billing`
WHERE `tgl_billing` = '2026-05-20'
SELECT COUNT(*) AS `numrows`
FROM `dokter`
WHERE `status` = '1'
SELECT *
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2026-05-20'
ORDER BY `jam_reg` ASC
 LIMIT 10
SELECT *
FROM `dokter`
WHERE `status` = '1'
ORDER BY `nm_dokter` ASC
 LIMIT 6
---
    public function index()
    {
        $this->requireLogin();
        $db = db_connect();
        $today = date('Y-m-d');

        $stats = [
            'Pasien' => $db->table('pasien')->countAllResults(),
            'Registrasi Hari Ini' => $db->table('reg_periksa')->where('tgl_registrasi', $today)->countAllResults(),
            'Rawat Jalan Hari Ini' => $db->table('reg_periksa')->where('tgl_registrasi', $today)->where('status_lanjut', 'Ralan')->countAllResults(),
            'Rawat Inap Aktif' => $db->table('kamar_inap')->where('tgl_keluar', null)->countAllResults(),
            'Resep Hari Ini' => $db->table('resep_obat')->where('tgl_peresepan', $today)->countAllResults(),
            'Order Lab Hari Ini' => $db->table('permintaan_lab')->where('tgl_permintaan', $today)->countAllResults(),
            'Order Radiologi Hari Ini' => $db->table('permintaan_radiologi')->where('tgl_permintaan', $today)->countAllResults(),
            'Billing Hari Ini' => $db->table('mlite_billing')->where('tgl_billing', $today)->countAllResults(),
            'Dokter Aktif' => $db->table('dokter')->where('status', '1')->countAllResults(),
        ];

        // Antrian hari ini (max 10)
        $antrian = $db->table('reg_periksa')
            ->where('tgl_registrasi', $today)
            ->orderBy('jam_reg', 'ASC')
            ->get(10)
            ->getResultArray();

        // Dokter aktif (max 6)
        $dokter_list = $db->table('dokter')
            ->where('status', '1')
            ->orderBy('nm_dokter', 'ASC')
            ->get(6)
            ->getResultArray();