app/Controllers/Laboratorium.php

    public function create(string $key)
    {
        $this->requireLogin();
        $cfg = $this->cfg($key);
        $db = db_connect();

        // Generate no order otomatis (PL + tanggal + urut)
        $prefix = 'PL' . date('Ymd');
        $last = $db->table('permintaan_lab')->like('noorder', $prefix, 'after')->orderBy('noorder', 'DESC')->get(1)->getRowArray();
        $urut = $last ? ((int) substr($last['noorder'], -4)) + 1 : 1;
        $noOrder = $prefix . str_pad((string) $urut, 4, '0', STR_PAD_LEFT);

        // Antrian hari ini
        $antrian = $db->table('reg_periksa r')
            ->select('r.no_rawat, r.no_rkm_medis, r.kd_dokter, r.kd_poli, r.jam_reg, p.nm_pasien, p.jk')
            ->join('pasien p', 'p.no_rkm_medis = r.no_rkm_medis', 'left')
            ->where('r.tgl_registrasi', date('Y-m-d'))
            ->orderBy('r.jam_reg', 'ASC')
            ->get()
            ->getResultArray();

        // Dokter aktif
        $dokter = $db->table('dokter')->where('status', '1')->orderBy('nm_dokter')->get()->getResultArray();
---
SELECT *
FROM `permintaan_lab`
WHERE `noorder` LIKE 'PL20260519%' ESCAPE '!'
ORDER BY `noorder` DESC
 LIMIT 1
SELECT `r`.`no_rawat`, `r`.`no_rkm_medis`, `r`.`kd_dokter`, `r`.`kd_poli`, `r`.`jam_reg`, `p`.`nm_pasien`, `p`.`jk`
FROM `reg_periksa` `r`
LEFT JOIN `pasien` `p` ON `p`.`no_rkm_medis` = `r`.`no_rkm_medis`
WHERE `r`.`tgl_registrasi` = '2026-05-19'
ORDER BY `r`.`jam_reg` ASC
SELECT *
FROM `dokter`
WHERE `status` = '1'
ORDER BY `nm_dokter`