app/Controllers/Pasien.php

    public function create(string $key)
    {
        $this->requireLogin();
        $cfg = $this->cfg($key);
        $db = db_connect();

        // Generate No. Rekam Medis otomatis (format: 000001, 000002, dst)
        $last = $db->table('pasien')->orderBy('no_rkm_medis', 'DESC')->get(1)->getRowArray();
        $lastNum = $last ? (int) $last['no_rkm_medis'] : 0;
        $noRM = str_pad((string) ($lastNum + 1), 6, '0', STR_PAD_LEFT);

        // Data referensi
        $penjamin = $db->table('penjab')->orderBy('png_jawab')->get()->getResultArray();
---
SELECT *
FROM `pasien`
ORDER BY `no_rkm_medis` DESC
 LIMIT 1
SELECT *
FROM `penjab`
ORDER BY `png_jawab`