app/Controllers/Registrasi.php

    public function create(string $key)
    {
        $this->requireLogin();
        $cfg = $this->cfg($key);
        $db = db_connect();

        // Generate no_rawat otomatis
        $prefix = date('Y/m/d');
        $last = $db->table('reg_periksa')->like('no_rawat', $prefix, 'after')->orderBy('no_rawat', 'DESC')->get(1)->getRowArray();
        $urut = $last ? ((int) substr($last['no_rawat'], -6)) + 1 : 1;
        $noRawat = $prefix . '/' . str_pad((string) $urut, 6, '0', STR_PAD_LEFT);

        // Generate no_reg
        $lastReg = $db->table('reg_periksa')->where('tgl_registrasi', date('Y-m-d'))->orderBy('no_reg', 'DESC')->get(1)->getRowArray();
        $noReg = $lastReg ? ((int) $lastReg['no_reg']) + 1 : 1;

        // Data referensi
        $dokter = $db->table('dokter')->where('status', '1')->orderBy('nm_dokter')->get()->getResultArray();
        $poli = $db->table('poliklinik')->where('status', '1')->orderBy('nm_poli')->get()->getResultArray();
        $penjamin = $db->table('penjab')->orderBy('png_jawab')->get()->getResultArray();
---
SELECT *
FROM `reg_periksa`
WHERE `no_rawat` LIKE '2026/05/19%' ESCAPE '!'
ORDER BY `no_rawat` DESC
 LIMIT 1
SELECT *
FROM `reg_periksa`
WHERE `tgl_registrasi` = '2026-05-19'
ORDER BY `no_reg` DESC
 LIMIT 1
SELECT *
FROM `dokter`
WHERE `status` = '1'
ORDER BY `nm_dokter`
SELECT *
FROM `poliklinik`
WHERE `status` = '1'
ORDER BY `nm_poli`
SELECT *
FROM `penjab`
ORDER BY `png_jawab`